modules/gateway/gateway-api/src/test/resources/com/l7tech/gateway/api/testMessages/Policy_GetPolicy_Response.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management" xmlns:mdo="http://schemas.wiseman.dev.java.net/metadata/messagetypes" xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmeta="http://schemas.dmtf.org/wbem/wsman/1/wsman/version1.0.0.a/default-addressing-model.xsd" xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:xs="http://www.w3.org/2001/XMLSchema"><env:Header><wsa:Action xmlns:ns11="http://ns.l7tech.com/2010/01/gateway-management" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</wsa:Action><wsman:FragmentTransfer Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116" env:mustUnderstand="true" xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management">l7:Resources/l7:ResourceSet[@tag='policy']/l7:Resource</wsman:FragmentTransfer><wsa:MessageID env:mustUnderstand="true">uuid:fb63cfe5-85bb-40ef-a994-de87848547fd</wsa:MessageID><wsa:RelatesTo>uuid:b8022c1e-90a6-4a53-8867-70df008eb85e</wsa:RelatesTo><wsa:To env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To></env:Header><env:Body xmlns:ns9="http://ns.l7tech.com/2010/01/gateway-management"><wsman:XmlFragment><ns9:Resource type="policy" xmlns="">&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;wsp:Policy xmlns:L7p="http://www.layer7tech.com/ws/policy" xmlns:wsp="http://schemas.xmlsoap.org/ws/2002/12/policy"&gt;
    &lt;wsp:All wsp:Usage="Required"&gt;
        &lt;L7p:AuditDetailAssertion&gt;
            &lt;L7p:Detail stringValue="Policy Fragment: 555"/&gt;
        &lt;/L7p:AuditDetailAssertion&gt;
    &lt;/wsp:All&gt;
&lt;/wsp:Policy&gt;
</ns9:Resource></wsman:XmlFragment></env:Body></env:Envelope>